package com.pyaesonehan.snakes.data.utils

import com.pyaesonehan.snakes.domin.model.Snake

object PreviewData {
    val snakes: List<Snake>  = listOf(
        Snake(
            id = 2,
            imageUrl = "",
            myanmarName = "မြွေပွေးမျိုး",
            englishName = "Vipers",
            detail = "\\nမြွေပွေးမျိုးများသည် အဆိပ်ပြင်းသော မြွေမျိုးဖြစ်သည်။၎င်းတို့တွင် ရှည်သောအစွယ်များရှိကာ အပေါ်မေးရိုး၏အရှေ့ဘက်တွင်ရှိသည်။ ထိုမေးရိုးသည် အစွယ်အားရှေ့နောက်ရွှေ့လျားအောင် ဆောင်ရွက်နိုင်သည်။\\n၎င်းတို့၏ အစွယ်သည် အယ်လာပိုင်းဒေး မျိုးရင်း( မြွေဟောက်မျိုးများ ) ထက်ပို၍ရှည်သည်။ အာဖရိကန်ဂါဘွန်မြွေပွေး ( African Garboon viper ) သည်အစွယ်အလွန်ရှည်ကာ အဆိပ်လည်းအလွန်ပြင်းသည်။\\nအစွယ်အရွယ်မှာ ၂ လက်မ ခန့်အထိ ရှည်သည်။မြွေပွေးများကို အုပ်စုနှစ်စုခွဲခြားထားပါသည်။ ၎င်းတို့မှာ ပိုက်တ် ဗိုင်ပါ ( Pit viper ) နှင့် ထရုဗိုင်ပါ( True viper )တို့ဖြစ်သည်။ ပိုက်တ် ဗိုင်ပါတွင်မျက်စိနှင့် နားကြားတွင် pit ဟုခေါ်သော ချိုင့်ခွက် အင်္ဂါအစိတ်အပိုင်း တစ်ခုရှိသည်။ ၎င်းမျိုးများတွင်\\nမျိုးစိတ်ပေါင်း ၁၀၀ ကျော်ရှိပြီး၊ အန္တာတိက၊ သြစတြေးလျတို့တွင် တွေ့ရသည်။ ပိုက်တ် ဗိုင်ပါတွင်မြောက်အမေရိကန် ကော့ပါးဟက်တ် ( North\\nAmerican copperheads )၊ ရက်တဲလ်စနိတ်( Rattlesnakes ) နှင့် ဝါတာမော့ကာစင်( Water moccasins ) စသည်တို့ပါဝင်သည်။\\nထရုဗိုင်ပါတွင် pit ခေါ် ချိုင့်ခွက်အင်္ဂါအစိတ်အပိုင်းမပါရှိပါ။ ထိုအမျိုးတွင် မျိုးစိတ်ပေါင်း ၅၀ ခန့်ရှိသည်။၎င်းတို့သည် အာဖရိက၊ အာရှနှင့် ဥရောပတို့တွင် တွေ့ရသည်။ ထရုဗိုင်ပါတွင် ဂါဘွန်ဗိုင်ပါ ( Garboon viper ) နှင့် ယူရိုပီယန် ဗိုင်ပါ ( European viper ) စသည်တို့ပါဝင်ကြသည်။\\nမြွေပွေးအမများသည် ဥများကို ၎င်းတို့၏ ခန္ဓာကိုယ်အတွင်း၌ ထားလျက် ခန္ဓာကိုယ်အတွင်း၌ပင် ဥမှပေါက်ကာအကောင်လိုက်မွေးဖွား မျိုးပွားကြသည်။မြွေပွေးတို့၏ မျိုးရင်းမှာ ဗိုင်ပါရိုင်းဒေး ( Viperidae )ဖြစ်သည်။",
            isPoisonous = "Yes",
            isDangerous = "Yes"
        ),
        Snake(
            id = 3,
            imageUrl = "",
            myanmarName = "မငန်းမြွေ",
            englishName = "Bungarus fasciatus",
            detail = "မြန်မာ့အလိုအားဖြင့် ငန်းမြွေအမျိုးမျိုး ရှိ၏။ အများအားဖြင့် ငန်းမြွေများသည် ကိုယ်ထည်ကြီးမား၍ အဆိပ်ရှိသော မြွေမျိုး ဖြစ်ကြသည်။ မြွေ၏ အသွေးအဆင်ကို ကြည့်၍ အမည်အမျိုးမျိုးဖြင့် ခေါ်တတ်ကြသည်။ တစ်ခါတစ်ရံ မြွေ တစ်မျိုးတည်းပင် အမည် ၃၊ ၄ မျိုးတပ်၍ ခေါ်တတ်ကြသည်။ ငန်းမြွေ အမျိုးမျိုးရှိသည့်အနက် ထင်ရှားသောငန်းမြွေများမှာ\\n\\nငန်းဝါ၊\\nငန်းပုပ်\\nငန်းသံကွင်းစပ်၊\\nငန်းစောင်း\\nငန်းတော်ကျား၊\\nငန်းဦးကွက်၊\\nငန်းနက်ကျား၊\\nငန်းတော်ရှည်တို့ ဖြစ်ကြသည်။\\nထိုငန်းမြွေမျိုးတို့နှင့် မျိုးချင်နွယ်သော အခြားငန်းမြွေများလည်း အမြောက် အမြား ရှိပေသေးသည်။ ငန်းမြွေကို အင်္ဂလိပ်လို 'ဟမ်မာဒြာ ရက်'ဟူ၍လည်းကောင်း၊ 'ဗန်ဂါရပ်'ဟူ၍လည်းကောင်း ငန်းမျိုးကိုလိုက်၍ ခေါ်၏။ ငန်းဝါကို အိန္ဒိယနိုင်ငံနှင့် မြန်မာနိုင်ငံတို့တွင် တွေ့ရသည် ဟု ဆိုသည်။ ငန်းဝါသည် အညိုရောင်ရှိ၍ အညိုဖျော့ရောင် ကန့်လန့်စင်းများ ပါရှိသည်။ လည်တိုင်ဝါ၏။ သို့သော် အချို့ ငန်းဝါမျိုးသည် အစိမ်းရောင်ရှိ၍ လည်တိုင်ဝါသည်။ ကိုယ် အောက်ပိုင်း၌ အစက်ပြောက်များ ပါရှိတတ်သည်။ သို့မဟုတ် အမည်းရောင်ရှိသည်။ အကောင်ငယ်ကလေးလည်းများမှာ အမည်း ရောင်ရှိ၍ အဖြူစင်းများ ပါရှိသည်။ ဦးခေါင်း၌လည်း အဖြူ စင်းများပါရှိသည်။ အရှည် ၁၄ ပေအထိ ကြီးထွားကြသည်။ ငန်းပုပ်ဟုခေါ်သော ငန်းမြွေမှာ အမည်းပုပ်ရောင်ရှိ၏။ ထိုငန်းပုပ်မျိုးသည် လူကိုလိုက်တတ်သည်ဟု အဆိုရှိသည်။ လိုက်ရာ၌ ပါးပျဉ်းထ၍ လိုက်၏။ တစ်ခါတစ်ခါ အမြီး ထောက်၍ ကြည့်၏။ ထိုနောက် လိုက်ပြန်၏။ မမြင်ရမှ မလိုက်ဘဲ နေ၏။ ✖\uFE0Fငန်းပုပ်သည် ရိုက်ပုတ်၍ မသေဘဲ လွတ်ပြေးလျှင် ရန်သူကို တစ်နှစ်ကျော်အထိ မမေ့တတ်ဘဲ ပြန်၍ ရန်မူတတ်သည်ဟု အဆိုရှိသည်။✖\uFE0F\\n\\n(အဟိတ်တိရစ္ဆာန်မြွေသည် အသိဉာဏ်ရှိလူသားမျိုးစိတ်ကဲ့သို့ အသိဉာဏ်မရှိပါ)\\nငန်းသံကွင်းစွပ်တွင် အဝါနှင့် အမည်းကွင်းများ တစ်ခုခြားစီ ပါရှိသည်။ ဦးခေါင်းမှာမည်း၍ လည်တိုင်နှင့် ကိုယ်အောက် ပိုင်းမှာ အဝါရောင်ရှိ၏။ အရှည် ၈ ပေအထိ ကြီးထွား၏။ ငန်းနက်ကျားကို အင်တိုင်းတောနှင့် တောချုံကြီးများတွင် အများအပြား တွေ့ရသည်။ အဆိပ်ပြင်းသောမြွေမျိုးဖြစ်သော် လည်း လူကို ရန်မရှာတတ်ပေ။ ဦးခေါင်းသေး၍ ကိုယ်ထည် ရှည်သည်။ ကိုယ်ရောင်မှာ ကတ္တီပါနက်ကဲ့သို့ရှိ၍ အဝါကွက် များ ပါရှိသည်။ ငန်းနက်ကျားသည် အလွန်လှသောမြွေမျိုး ဖြစ်သည်။ ✖\uFE0Fငန်းတော်ရှည်ကို မြွေမင်းသား သို့မဟုတ် မြွေ သူတော်ဟု ခေါ်တတ်ကြသည်။ ကိုယ်ထည်ရှည်၍ အဆိပ် မရှိပေ။ ငန်းတော်ရှည်ကို အခြားမြွေများက ကြောက်ရသည်ဟုဆိုသည်✖\uFE0F\\n\\nငန်းတော်ကြားမြွေအဆိပ်သည်လူ၏အာရုံကြောကိုပျက်ဆီးစေနိုင်သည်။ မြန်မာနိုင်ငံတွင်\u200Cငန်း\u200C\u200Cေတာ်ကြား\u200Cေမြွဆိပ်\u200Cေဖြ\u200Cေဆးမရှိပါ...\\n\\nငန်းမြွေများသပ်သပ်ရှိကြသော်လည်း လူကို ဘေးအန္တရာယ်မပြုတတ်ကြပေ။ ငန်းမြွေများသည် ကိုယ်ထည်ကြီးမားကြသဖြင့် ယင်းတို့ကို တွေ့မြင်လွယ်သည်။ လယ်ယာများတွင် မနေတတ်ကြ။ တောထူထပ်သောဒေသ များတွင် ချုံထဲ၊ သစ်ခေါင်းထဲ၌ နေတတ်ကြသည်။ ငန်းမြွေ သည် ပါးပျဉ်းကြီး၍ လှပသောကြောင့် အလမ္ပာယ်ဆရာများက မြွေပြသရာတွင် ငန်းမြွေကို အကခိုင်းတတ်ကြသည်။",
            isPoisonous = "Yes",
            isDangerous = "Yes"
        )
    )
}